Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_scheduler_job.scheduler["delete-expired-reservations"] will be created
  + resource "google_cloud_scheduler_job" "scheduler" {
      + attempt_deadline = "320s"
      + description      = "http job"
      + id               = (known after apply)
      + name             = "delete-expired-reservations"
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "*/5 * * * *"
      + time_zone        = "Asia/Calcutta"

      + http_target {
          + http_method = "POST"
          + uri         = "https://services-dev.ibo.com/inventory/v1/demand/delete-expired-reservations"
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #477](https://github.com/ebomart/commerce-infrastructure/actions/runs/1926473841)